apache/nuttx/arch/arm/src/ra8m1/ra_serial.c
static uart_dev_t  g_uart4port =
{
  .recv     =
  {
    .size   = CONFIG_SCI4_RXBUFSIZE,
    .buffer = g_uart4rxbuffer,
  },
  .xmit  =
  {
    .size   = CONFIG_SCI4_TXBUFSIZE,
    .buffer = g_uart4txbuffer,
  },
  .ops   = &g_uart_ops,
  .priv = &g_uart4priv,
};
#endif

#if defined(CONFIG_RA_SCI9_UART)
static struct up_dev_s  g_uart9priv =
{
  .scibase      = R_SCI_B9_BASE,
  .mstp         = R_MSTP_MSTPCRB_MSTPB22,
  .rxirq        = SCI9_RXI,
  .txirq        = SCI9_TXI,
  .teirq        = SCI9_TEI,
  .erirq        = SCI9_ERI,
  .baud         = CONFIG_SCI9_BAUD,
  .parity       = CONFIG_SCI9_PARITY,
  .bits         = CONFIG_SCI9_BITS,
  .stopbits2    = CONFIG_SCI9_2STOP,
};

static uart_dev_t  g_uart9port =
{
  .recv     =
  {
    .size   = CONFIG_SCI9_RXBUFSIZE,
    .buffer = g_uart9rxbuffer,
  },
  .xmit  =
  {
    .size   = CONFIG_SCI9_TXBUFSIZE,
    .buffer = g_uart9txbuffer,
  },
  .ops   = &g_uart_ops,
  .priv = &g_uart9priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_serialin
 ****************************************************************************/

static inline uint32_t up_serialin(struct up_dev_s *priv, int offset)
{
  return getreg32(priv->scibase + offset);
}

/****************************************************************************
 * Name: up_serialout
 ****************************************************************************/

static inline void up_serialout(struct up_dev_s *priv, int offset,
                                 uint32_t value)
{
  putreg32(value, priv->scibase + offset);
}

/****************************************************************************
 * Name: up_disableallints
 ****************************************************************************/

static void up_disableallints(struct up_dev_s *priv, uint32_t *ie)
{
  irqstate_t flags;
  uint32_t  regval = 0;

  /* The following must be atomic */

  flags = enter_critical_section();
  if (ie)
    {
      /* Return the current interrupt mask */

      *ie = up_serialin(priv, R_SCI_B_CCR0_OFFSET);
    }

  /* Disable all interrupts */

  regval = up_serialin(priv, R_SCI_B_CCR0_OFFSET) &
    ~(R_SCI_B_CCR0_TIE | R_SCI_B_CCR0_RIE);
  up_serialout(priv, R_SCI_B_CCR0_OFFSET, regval);

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: up_sci_config
 *
 * Description:
 *   Configure the SCI_B baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

static void up_sci_config(struct up_dev_s *priv)
{
  uint32_t  regval          = 0;

  /* Disable the channel while it is (re)configured */

  up_serialout(priv, R_SCI_B_CCR0_OFFSET, 0);

  /* Character length and stop bits live in CCR3.CHR/CCR3.STP.  Unlike the
   * legacy SCI, SCI_B has no separate SCMR.CHR1 -- CCR3.CHR is a single
   * 2-bit field:  00/01 = 9-bit, 10 = 8-bit (reset value), 11 = 7-bit.
   */

  regval  = up_serialin(priv, R_SCI_B_CCR3_OFFSET);
  regval &= ~(R_SCI_B_CCR3_CHR_MASK << R_SCI_B_CCR3_CHR_SHIFT);

  if (priv->bits == 9)
    {
      regval |= R_SCI_B_CCR3_CHR_V00;
    }
  else if (priv->bits == 7)
    {
      regval |= R_SCI_B_CCR3_CHR_V11;
    }
  else
    {
      regval |= R_SCI_B_CCR3_CHR_V10;
    }

  if (priv->stopbits2)
    {
      regval |= R_SCI_B_CCR3_STP;
    }
  else
    {
      regval &= ~R_SCI_B_CCR3_STP;
    }

  regval &= ~(R_SCI_B_CCR3_MOD_MASK << R_SCI_B_CCR3_MOD_SHIFT);
  regval |= R_SCI_B_CCR3_MOD_ASYNCHRONOUS;
  up_serialout(priv, R_SCI_B_CCR3_OFFSET, regval);

  /* Parity lives in CCR1.PE/CCR1.PM */

  regval  = up_serialin(priv, R_SCI_B_CCR1_OFFSET);
  regval &= ~(R_SCI_B_CCR1_PE | R_SCI_B_CCR1_PM);

  if (priv->parity > 0)
    {
      regval |= R_SCI_B_CCR1_PE;
      if (priv->parity == 1)
        {
          regval |= R_SCI_B_CCR1_PM;
        }
    }

  up_serialout(priv, R_SCI_B_CCR1_OFFSET, regval);

  /* The baud rate generator lives in CCR2 (BGDM/ABCS/ABCSE, CKS and BRR).
   * Its clock is SCICLK, not PCLKA, as long as the synchronizer bypass
   * (CCR3.BPEN) stays off.  ra_sci_baud_ccr2() picks the settings with the
   * smallest error (RA8M1 User's Manual Table 31.7).
   */

  regval  = up_serialin(priv, R_SCI_B_CCR2_OFFSET);
  regval &= ~(R_SCI_B_CCR2_BGDM | R_SCI_B_CCR2_ABCS | R_SCI_B_CCR2_ABCSE |
              (R_SCI_B_CCR2_BRR_MASK << R_SCI_B_CCR2_BRR_SHIFT) |
              (R_SCI_B_CCR2_CKS_MASK << R_SCI_B_CCR2_CKS_SHIFT));
  regval |= ra_sci_baud_ccr2(RA_SCICLK_FREQUENCY, priv->baud);
  up_serialout(priv, R_SCI_B_CCR2_OFFSET, regval);

  /* Re-enable the channel: transmit/receive plus their interrupts */

  regval = (R_SCI_B_CCR0_TE | R_SCI_B_CCR0_RE | R_SCI_B_CCR0_TIE |
            R_SCI_B_CCR0_RIE | R_SCI_B_CCR0_TEIE);
  up_serialout(priv, R_SCI_B_CCR0_OFFSET, regval);
}

static int up_setup(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  /* Dispatch on the channel's own base address rather than a global
   * #elif: several SCI_B channels may be enabled at once (see the
   * ttyS0-ttyS5 assignment ladder above), so GPIO setup must be chosen
   * per-device, not per-build.
   */

#if defined(CONFIG_RA_SCI0_UART)
  if (priv->scibase == R_SCI_B0_BASE)
    {
      ra_configgpio(GPIO_SCI0_RX);
      ra_configgpio(GPIO_SCI0_TX);
    }

#endif
#if defined(CONFIG_RA_SCI1_UART)
  if (priv->scibase == R_SCI_B1_BASE)
    {
      ra_configgpio(GPIO_SCI1_RX);
      ra_configgpio(GPIO_SCI1_TX);
    }

#endif
#if defined(CONFIG_RA_SCI2_UART)
  if (priv->scibase == R_SCI_B2_BASE)
    {
      ra_configgpio(GPIO_SCI2_RX);
      ra_configgpio(GPIO_SCI2_TX);
    }

#endif
#if defined(CONFIG_RA_SCI3_UART)
  if (priv->scibase == R_SCI_B3_BASE)
    {
      ra_configgpio(GPIO_SCI3_RX);
      ra_configgpio(GPIO_SCI3_TX);
    }

#endif
#if defined(CONFIG_RA_SCI4_UART)
  if (priv->scibase == R_SCI_B4_BASE)
    {
      ra_configgpio(GPIO_SCI4_RX);
      ra_configgpio(GPIO_SCI4_TX);
    }

#endif
#if defined(CONFIG_RA_SCI9_UART)
  if (priv->scibase == R_SCI_B9_BASE)
    {
      ra_configgpio(GPIO_SCI9_RX);
      ra_configgpio(GPIO_SCI9_TX);
    }

#endif

